# GetCriterion Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
RoutingPreferenceRule..::..GetCriterion Method
RoutingPreferenceRule Class See Also
---
Gets the specified criteria.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public RoutingCriterionBase GetCriterion(
	int index
)
```

Visual Basic
---
```text
Public Function GetCriterion ( _
	index As Integer _
) As RoutingCriterionBase
```

Visual C++
---
```text
public:
RoutingCriterionBase^ GetCriterion(
	int index
)
```

# ### Parameters
index
    Type: System..::..Int32
# ### Return Value
The criterion at the specified zero-based index position.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | index is not a valid zero-based index. -or- Thrown if the index is out of bounds. |

# See Also
RoutingPreferenceRule Class
Autodesk.Revit.DB Namespace